EN_TO_RU_MONTH = {
    "January": "Января",
    "February": "Декабря",
    "March": "Марта",
    "April": "Апреля",
    "May": "Мая",
    "June": "Июня",
    "July": "Июля",
    "August": "Августа",
    "September": "Сентября",
    "October": "Октября",
    "November": "Ноября",
    "December": "Декабря",
}

INFO_TEXT = (
    "👋 <b>Привет, сосед!</b>\n"
    "Тут ты сможешь получить больше информации о боте и узнать о его функциях.\n\n"
    "❓Что за бот?\n"
    "❕<i>Это некоммерческий проект, разработанный вашим соседом. Работает сугубо в рамках нашего ЖК «Армейский». Служит для облегчения жизни соседям.</i>\n\n"
    "❓Для чего нужен?\n"
    "❕<i>Нужен для того, чтобы дать людям возможность, максимально быстро получать актуальную информацию об электроэнергии в ЖК и сопутствующую информацию. Ну и ,конечно же, очистить чат ОСМД от постоянных вопросов, по типу «Света есть? А когда ушла?»</i> 😄\n\n"
    "❓Что умеет?\n"
    "❕<i>1. Сообщать о наличии электроэнергии в любое время суток, а также время, когда было отключение/включение;\n"
    "2. Рассылать уведомления подписанным на рассылку пользователям, в момент, когда случается отключение/включение;\n"
    "3. Выдавать статистику за последнее время о наличии электроэнергии;\n"
    "4…если бот будет востребован, функционал будет дополняться.</i>\n\n"
    "❓Зачем ему информация обо мне?\n"
    "❕<i>Бот не собирает и не хранит никакой информации о пользователях, кроме той, что предоставляют ему пользователи по своему желанию, а также сам Telegram. Информация при регистрации служит для формирования более качественной статистики о выключениях электричества для пользователей. При желании оставаться анонимным, формы можно не заполнять.</i>\n\n"
    "❓На какие ЖК распространяется работа бота?\n"
    "❕<i>Бот заточен для работы в пределах ЖК «Армейский».  Им можно делиться с жителями других комплексов, график отключений которых совпадают с нашим, но гарантировать 100% точность, увы, будет невозможно.</i>\n\n"
    "Спасибо за внимание ✌️"
)
REG_TEXT = (
    "Регистрация, всё что нужно- выбрать свой дом и ввести номер квартиры\n\n"
    "<i>Это нужно для лучшей статистики, можно пропустить</i>\n\nВаш адрес Армейская 8..?\n(выбрать ниже)"
)
SUPPORT_TEXT = (
    "<b>📢 Обратная связь</b>\n\n"
    "Чтобы зарегистрировать обращение, напишите боту текст, так же, как вы обычно пишите сообщения.\n"
    "Вы можете отправлять сюда:\n"
    "<b>проблемные моменты;\n"
    "свои отзывы;\n"
    "предложения по улучшению функционала.</b>\n"
    "Старайтесь, на сколько это возможно, писать понятно и компактно 👍"
)
